Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/atdf/PIC32CZ4010CA80144.atdf
        <interrupt name="MLB_GENERAL" index="218" module-instance="MLB" caption="Media Local Bus General Interrupt"/>
        <interrupt name="MLB_BUSREQ" index="219" module-instance="MLB" caption="Media Local Bus Request Interrupt"/>
        <interrupt name="CM7H_CTIIRQ_0" index="220" module-instance="CM7H" caption="Cross Trigger Interface Interrupt 0"/>
        <interrupt name="CM7H_CTIIRQ_1" index="221" module-instance="CM7H" caption="Cross Trigger Interface Interrupt 1"/>
      </interrupts>
      <events>
        <generators>
          <generator name="SUPC_LVDET" index="1" module-instance="SUPC"/>
          <generator name="OSCCTRL_XOSC_FAIL" index="2" module-instance="OSCCTRL"/>
          <generator name="OSC32KCTRL_XOSC32K_FAIL" index="3" module-instance="OSC32KCTRL"/>
          <generator name="FREQM_DONE" index="4" module-instance="FREQM"/>
          <generator name="FREQM_WINMON" index="5" module-instance="FREQM"/>
          <generator name="RTC_PER_0" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="8" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="9" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="10" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="11" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="12" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="13" module-instance="RTC"/>
          <generator name="RTC_CMP_0" index="14" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="15" module-instance="RTC"/>
          <generator name="RTC_CMP_2" index="16" module-instance="RTC"/>
          <generator name="RTC_CMP_3" index="17" module-instance="RTC"/>
          <generator name="RTC_TAMPER" index="18" module-instance="RTC"/>
          <generator name="RTC_OVF" index="19" module-instance="RTC"/>
          <generator name="RTC_PERD" index="20" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="21" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="22" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="23" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="24" module-instance="EIC"/>
          <generator name="EIC_EXTINT_4" index="25" module-instance="EIC"/>
          <generator name="EIC_EXTINT_5" index="26" module-instance="EIC"/>
          <generator name="EIC_EXTINT_6" index="27" module-instance="EIC"/>
          <generator name="EIC_EXTINT_7" index="28" module-instance="EIC"/>
          <generator name="EIC_EXTINT_8" index="29" module-instance="EIC"/>
          <generator name="EIC_EXTINT_9" index="30" module-instance="EIC"/>
          <generator name="EIC_EXTINT_10" index="31" module-instance="EIC"/>
          <generator name="EIC_EXTINT_11" index="32" module-instance="EIC"/>
          <generator name="EIC_EXTINT_12" index="33" module-instance="EIC"/>
          <generator name="EIC_EXTINT_13" index="34" module-instance="EIC"/>
          <generator name="EIC_EXTINT_14" index="35" module-instance="EIC"/>
          <generator name="EIC_EXTINT_15" index="36" module-instance="EIC"/>
          <generator name="PAC_ACCERR" index="37" module-instance="PAC"/>
          <generator name="DMA_CH_0" index="38" module-instance="DMA"/>
          <generator name="DMA_CH_1" index="39" module-instance="DMA"/>
          <generator name="DMA_CH_2" index="40" module-instance="DMA"/>
          <generator name="DMA_CH_3" index="41" module-instance="DMA"/>
          <generator name="DMA_CH_4" index="42" module-instance="DMA"/>
          <generator name="DMA_CH_5" index="43" module-instance="DMA"/>
          <generator name="DMA_CH_6" index="44" module-instance="DMA"/>
          <generator name="DMA_CH_7" index="45" module-instance="DMA"/>
          <generator name="DMA_CH_8" index="46" module-instance="DMA"/>
          <generator name="DMA_CH_9" index="47" module-instance="DMA"/>
          <generator name="DMA_CH_10" index="48" module-instance="DMA"/>
          <generator name="DMA_CH_11" index="49" module-instance="DMA"/>
          <generator name="DMA_CH_12" index="50" module-instance="DMA"/>
          <generator name="DMA_CH_13" index="51" module-instance="DMA"/>
          <generator name="DMA_CH_14" index="52" module-instance="DMA"/>
          <generator name="DMA_CH_15" index="53" module-instance="DMA"/>
          <generator name="TCC0_OVF" index="54" module-instance="TCC0"/>
          <generator name="TCC0_TRG" index="55" module-instance="TCC0"/>
          <generator name="TCC0_CNT" index="56" module-instance="TCC0"/>
          <generator name="TCC0_MC_0" index="57" module-instance="TCC0"/>
          <generator name="TCC0_MC_1" index="58" module-instance="TCC0"/>
          <generator name="TCC0_MC_2" index="59" module-instance="TCC0"/>
          <generator name="TCC0_MC_3" index="60" module-instance="TCC0"/>
          <generator name="TCC0_MC_4" index="61" module-instance="TCC0"/>
          <generator name="TCC0_MC_5" index="62" module-instance="TCC0"/>
          <generator name="TCC0_MC_6" index="63" module-instance="TCC0"/>
          <generator name="TCC0_MC_7" index="64" module-instance="TCC0"/>
          <generator name="TCC1_OVF" index="65" module-instance="TCC1"/>
          <generator name="TCC1_TRG" index="66" module-instance="TCC1"/>
          <generator name="TCC1_CNT" index="67" module-instance="TCC1"/>
          <generator name="TCC1_MC_0" index="68" module-instance="TCC1"/>
          <generator name="TCC1_MC_1" index="69" module-instance="TCC1"/>
          <generator name="TCC1_MC_2" index="70" module-instance="TCC1"/>
          <generator name="TCC1_MC_3" index="71" module-instance="TCC1"/>
          <generator name="TCC1_MC_4" index="72" module-instance="TCC1"/>
          <generator name="TCC1_MC_5" index="73" module-instance="TCC1"/>
          <generator name="TCC1_MC_6" index="74" module-instance="TCC1"/>
          <generator name="TCC1_MC_7" index="75" module-instance="TCC1"/>
          <generator name="TCC2_OVF" index="76" module-instance="TCC2"/>
          <generator name="TCC2_TRG" index="77" module-instance="TCC2"/>
          <generator name="TCC2_CNT" index="78" module-instance="TCC2"/>
          <generator name="TCC2_MC_0" index="79" module-instance="TCC2"/>
          <generator name="TCC2_MC_1" index="80" module-instance="TCC2"/>
          <generator name="TCC2_MC_2" index="81" module-instance="TCC2"/>
          <generator name="TCC2_MC_3" index="82" module-instance="TCC2"/>
          <generator name="TCC2_MC_4" index="83" module-instance="TCC2"/>
          <generator name="TCC2_MC_5" index="84" module-instance="TCC2"/>
          <generator name="TCC3_OVF" index="85" module-instance="TCC3"/>
          <generator name="TCC3_TRG" index="86" module-instance="TCC3"/>
          <generator name="TCC3_CNT" index="87" module-instance="TCC3"/>
          <generator name="TCC3_MC_0" index="88" module-instance="TCC3"/>
          <generator name="TCC3_MC_1" index="89" module-instance="TCC3"/>
          <generator name="TCC4_OVF" index="90" module-instance="TCC4"/>
          <generator name="TCC4_TRG" index="91" module-instance="TCC4"/>
          <generator name="TCC4_CNT" index="92" module-instance="TCC4"/>
          <generator name="TCC4_MC_0" index="93" module-instance="TCC4"/>
          <generator name="TCC4_MC_1" index="94" module-instance="TCC4"/>
          <generator name="TCC5_OVF" index="95" module-instance="TCC5"/>
          <generator name="TCC5_TRG" index="96" module-instance="TCC5"/>
          <generator name="TCC5_CNT" index="97" module-instance="TCC5"/>
          <generator name="TCC5_MC_0" index="98" module-instance="TCC5"/>
          <generator name="TCC5_MC_1" index="99" module-instance="TCC5"/>
          <generator name="TCC6_OVF" index="100" module-instance="TCC6"/>
          <generator name="TCC6_TRG" index="101" module-instance="TCC6"/>
          <generator name="TCC6_CNT" index="102" module-instance="TCC6"/>
          <generator name="TCC6_MC_0" index="103" module-instance="TCC6"/>
          <generator name="TCC6_MC_1" index="104" module-instance="TCC6"/>
          <generator name="TCC7_OVF" index="105" module-instance="TCC7"/>
          <generator name="TCC7_TRG" index="106" module-instance="TCC7"/>
          <generator name="TCC7_CNT" index="107" module-instance="TCC7"/>
          <generator name="TCC7_MC_0" index="108" module-instance="TCC7"/>
          <generator name="TCC7_MC_1" index="109" module-instance="TCC7"/>
          <generator name="TCC8_OVF" index="110" module-instance="TCC8"/>
          <generator name="TCC8_TRG" index="111" module-instance="TCC8"/>
          <generator name="TCC8_CNT" index="112" module-instance="TCC8"/>
          <generator name="TCC8_MC_0" index="113" module-instance="TCC8"/>
          <generator name="TCC8_MC_1" index="114" module-instance="TCC8"/>
          <generator name="TCC9_OVF" index="115" module-instance="TCC9"/>
          <generator name="TCC9_TRG" index="116" module-instance="TCC9"/>
          <generator name="TCC9_CNT" index="117" module-instance="TCC9"/>
          <generator name="TCC9_MC_0" index="118" module-instance="TCC9"/>
          <generator name="TCC9_MC_1" index="119" module-instance="TCC9"/>
          <generator name="TCC9_MC_2" index="120" module-instance="TCC9"/>
          <generator name="TCC9_MC_3" index="121" module-instance="TCC9"/>
          <generator name="TCC9_MC_4" index="122" module-instance="TCC9"/>
          <generator name="TCC9_MC_5" index="123" module-instance="TCC9"/>
          <generator name="ADC_CHRDYC_0" index="124" module-instance="ADC"/>
          <generator name="ADC_CHRDYC_1" index="125" module-instance="ADC"/>
          <generator name="ADC_CHRDYC_2" index="126" module-instance="ADC"/>
          <generator name="ADC_CHRDYC_3" index="127" module-instance="ADC"/>
          <generator name="ADC_CMP_0" index="128" module-instance="ADC"/>
          <generator name="ADC_CMP_1" index="129" module-instance="ADC"/>
          <generator name="ADC_CMP_2" index="130" module-instance="ADC"/>
          <generator name="ADC_CMP_3" index="131" module-instance="ADC"/>
          <generator name="AC_COMP_0" index="132" module-instance="AC"/>
          <generator name="AC_COMP_1" index="133" module-instance="AC"/>
          <generator name="AC_WIN_0" index="134" module-instance="AC"/>
          <generator name="PTC_EOC" index="135" module-instance="PTC"/>
          <generator name="PTC_WCOMP" index="136" module-instance="PTC"/>
          <generator name="ETH_TSU_CMP" index="137" module-instance="ETH"/>
          <generator name="TRNG_READY" index="138" module-instance="TRNG"/>
        </generators>
        <users>
          <user name="FREQM_START" index="0" module-instance="FREQM"/>
          <user name="RTC_TAMPER" index="1" module-instance="RTC"/>
          <user name="PORT_EV_0" index="2" module-instance="PORT"/>
          <user name="PORT_EV_1" index="3" module-instance="PORT"/>
          <user name="PORT_EV_2" index="4" module-instance="PORT"/>
          <user name="PORT_EV_3" index="5" module-instance="PORT"/>
          <user name="DMA_CHSTRT_0" index="6" module-instance="DMA"/>
          <user name="DMA_CHSTRT_1" index="7" module-instance="DMA"/>
          <user name="DMA_CHSTRT_2" index="8" module-instance="DMA"/>
          <user name="DMA_CHSTRT_3" index="9" module-instance="DMA"/>
          <user name="DMA_CHSTRT_4" index="10" module-instance="DMA"/>
          <user name="DMA_CHSTRT_5" index="11" module-instance="DMA"/>
          <user name="DMA_CHSTRT_6" index="12" module-instance="DMA"/>
          <user name="DMA_CHSTRT_7" index="13" module-instance="DMA"/>
          <user name="DMA_CHSTRT_8" index="14" module-instance="DMA"/>
          <user name="DMA_CHSTRT_9" index="15" module-instance="DMA"/>
          <user name="DMA_CHSTRT_10" index="16" module-instance="DMA"/>
          <user name="DMA_CHSTRT_11" index="17" module-instance="DMA"/>
          <user name="DMA_CHSTRT_12" index="18" module-instance="DMA"/>
          <user name="DMA_CHSTRT_13" index="19" module-instance="DMA"/>
          <user name="DMA_CHSTRT_14" index="20" module-instance="DMA"/>
          <user name="DMA_CHSTRT_15" index="21" module-instance="DMA"/>
          <user name="DMA_CHAUX_0" index="22" module-instance="DMA"/>
          <user name="DMA_CHAUX_1" index="23" module-instance="DMA"/>
          <user name="DMA_CHAUX_2" index="24" module-instance="DMA"/>
          <user name="DMA_CHAUX_3" index="25" module-instance="DMA"/>
          <user name="DMA_CHAUX_4" index="26" module-instance="DMA"/>
          <user name="DMA_CHAUX_5" index="27" module-instance="DMA"/>
          <user name="DMA_CHAUX_6" index="28" module-instance="DMA"/>
          <user name="DMA_CHAUX_7" index="29" module-instance="DMA"/>
          <user name="DMA_CHAUX_8" index="30" module-instance="DMA"/>
          <user name="DMA_CHAUX_9" index="31" module-instance="DMA"/>
          <user name="DMA_CHAUX_10" index="32" module-instance="DMA"/>
          <user name="DMA_CHAUX_11" index="33" module-instance="DMA"/>
          <user name="DMA_CHAUX_12" index="34" module-instance="DMA"/>
          <user name="DMA_CHAUX_13" index="35" module-instance="DMA"/>
          <user name="DMA_CHAUX_14" index="36" module-instance="DMA"/>
          <user name="DMA_CHAUX_15" index="37" module-instance="DMA"/>
          <user name="TCC0_EV_0" index="38" module-instance="TCC0"/>
          <user name="TCC0_EV_1" index="39" module-instance="TCC0"/>
          <user name="TCC0_MC_0" index="40" module-instance="TCC0"/>
          <user name="TCC0_MC_1" index="41" module-instance="TCC0"/>
          <user name="TCC0_MC_2" index="42" module-instance="TCC0"/>
          <user name="TCC0_MC_3" index="43" module-instance="TCC0"/>
          <user name="TCC0_MC_4" index="44" module-instance="TCC0"/>
          <user name="TCC0_MC_5" index="45" module-instance="TCC0"/>
          <user name="TCC0_MC_6" index="46" module-instance="TCC0"/>
          <user name="TCC0_MC_7" index="47" module-instance="TCC0"/>
          <user name="TCC1_EV_0" index="48" module-instance="TCC1"/>
          <user name="TCC1_EV_1" index="49" module-instance="TCC1"/>
          <user name="TCC1_MC_0" index="50" module-instance="TCC1"/>
          <user name="TCC1_MC_1" index="51" module-instance="TCC1"/>
          <user name="TCC1_MC_2" index="52" module-instance="TCC1"/>
          <user name="TCC1_MC_3" index="53" module-instance="TCC1"/>
          <user name="TCC1_MC_4" index="54" module-instance="TCC1"/>
          <user name="TCC1_MC_5" index="55" module-instance="TCC1"/>
          <user name="TCC1_MC_6" index="56" module-instance="TCC1"/>
          <user name="TCC1_MC_7" index="57" module-instance="TCC1"/>
          <user name="TCC2_EV_0" index="58" module-instance="TCC2"/>
          <user name="TCC2_EV_1" index="59" module-instance="TCC2"/>
          <user name="TCC2_MC_0" index="60" module-instance="TCC2"/>
          <user name="TCC2_MC_1" index="61" module-instance="TCC2"/>
          <user name="TCC2_MC_2" index="62" module-instance="TCC2"/>
          <user name="TCC2_MC_3" index="63" module-instance="TCC2"/>
          <user name="TCC2_MC_4" index="64" module-instance="TCC2"/>
          <user name="TCC2_MC_5" index="65" module-instance="TCC2"/>
          <user name="TCC3_EV_0" index="66" module-instance="TCC3"/>
          <user name="TCC3_EV_1" index="67" module-instance="TCC3"/>
          <user name="TCC3_MC_0" index="68" module-instance="TCC3"/>
          <user name="TCC3_MC_1" index="69" module-instance="TCC3"/>
          <user name="TCC4_EV_0" index="70" module-instance="TCC4"/>
          <user name="TCC4_EV_1" index="71" module-instance="TCC4"/>
          <user name="TCC4_MC_0" index="72" module-instance="TCC4"/>
          <user name="TCC4_MC_1" index="73" module-instance="TCC4"/>
          <user name="TCC5_EV_0" index="74" module-instance="TCC5"/>
          <user name="TCC5_EV_1" index="75" module-instance="TCC5"/>
          <user name="TCC5_MC_0" index="76" module-instance="TCC5"/>
          <user name="TCC5_MC_1" index="77" module-instance="TCC5"/>
          <user name="TCC6_EV_0" index="78" module-instance="TCC6"/>
          <user name="TCC6_EV_1" index="79" module-instance="TCC6"/>
          <user name="TCC6_MC_0" index="80" module-instance="TCC6"/>
          <user name="TCC6_MC_1" index="81" module-instance="TCC6"/>
          <user name="TCC7_EV_0" index="82" module-instance="TCC7"/>
          <user name="TCC7_EV_1" index="83" module-instance="TCC7"/>
          <user name="TCC7_MC_0" index="84" module-instance="TCC7"/>
          <user name="TCC7_MC_1" index="85" module-instance="TCC7"/>
          <user name="TCC8_EV_0" index="86" module-instance="TCC8"/>
          <user name="TCC8_EV_1" index="87" module-instance="TCC8"/>
          <user name="TCC8_MC_0" index="88" module-instance="TCC8"/>
          <user name="TCC8_MC_1" index="89" module-instance="TCC8"/>
          <user name="TCC9_EV_0" index="90" module-instance="TCC9"/>
          <user name="TCC9_EV_1" index="91" module-instance="TCC9"/>
          <user name="TCC9_MC_0" index="92" module-instance="TCC9"/>
          <user name="TCC9_MC_1" index="93" module-instance="TCC9"/>
          <user name="TCC9_MC_2" index="94" module-instance="TCC9"/>
          <user name="TCC9_MC_3" index="95" module-instance="TCC9"/>
          <user name="TCC9_MC_4" index="96" module-instance="TCC9"/>
          <user name="TCC9_MC_5" index="97" module-instance="TCC9"/>
          <user name="ADC_TRIGGERS_0" index="98" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_1" index="99" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_2" index="100" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_3" index="101" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_4" index="102" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_5" index="103" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_6" index="104" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_7" index="105" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_8" index="106" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_9" index="107" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_10" index="108" module-instance="ADC"/>
          <user name="AC_SOC_0" index="109" module-instance="AC"/>
          <user name="AC_SOC_1" index="110" module-instance="AC"/>
          <user name="PTC_DSEQR" index="111" module-instance="PTC"/>
          <user name="PTC_STCONV" index="112" module-instance="PTC"/>
          <user name="HSM_TAMPER_0" index="113" module-instance="HSM"/>
          <user name="HSM_TAMPER_1" index="114" module-instance="HSM"/>
          <user name="HSM_TAMPER_2" index="115" module-instance="HSM"/>
          <user name="HSM_TAMPER_3" index="116" module-instance="HSM"/>
        </users>
      </events>
      <interfaces>
        <interface name="JTAG" type="samjtag"/>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x09207053"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="03784" name2="cmp_ac_u2501_v2" version="2a0" caption="Analog Comparator Controller">
      <register-group name="AC" caption="Analog Comparator Controller">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
          <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
        </register>
        <register name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Control C">
          <bitfield name="WIDTH" caption="Sample and Hold Clock Pulse Width" mask="0x3FF"/>
          <bitfield name="PER" caption="Sample and Hold Clock Period" mask="0x3FF000"/>
          <bitfield name="PRESCALER" caption="Prescaling Factor" mask="0x7000000" values="CTRLC__PRESCALER"/>
          <bitfield name="AIPMPEN" caption="Analog Input Charge Pump Enable" mask="0x8000000"/>
          <bitfield name="CONFIG" caption="Configuration Extension" mask="0xF0000000"/>
        </register>
        <register name="EVCTRL" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1"/>
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2"/>
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x100"/>
          <bitfield name="COMPEI0" caption="Comparator 0 Event Input Enable" mask="0x10000"/>
          <bitfield name="COMPEI1" caption="Comparator 1 Event Input Enable" mask="0x20000"/>
          <bitfield name="INVEI0" caption="Inverted Event Input Enable 0" mask="0x1000000"/>
          <bitfield name="INVEI1" caption="Inverted Event Input Enable 1" mask="0x2000000"/>
        </register>
        <register name="INTENCLR" offset="0x10" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x100"/>
        </register>
        <register name="INTENSET" offset="0x14" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x100"/>
        </register>
        <register name="INTFLAG" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="COMP0" caption="Comparator 0" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0" mask="0x100"/>
        </register>
        <register name="STATUSA" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="Status A">
          <bitfield name="STATE0" caption="Comparator 0 Current State" mask="0x1"/>
          <bitfield name="STATE1" caption="Comparator 1 Current State" mask="0x2"/>
          <bitfield name="WSTATE0" caption="Window 0 Current State" mask="0x30000" values="STATUSA__WSTATE"/>
          <bitfield name="WSTATE1" caption="Window 1 Current State" mask="0xC0000" values="STATUSA__WSTATE"/>
        </register>
        <register name="STATUSB" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Status B">
          <bitfield name="READY0" caption="Comparator 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="Comparator 1 Ready" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
