Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/atdf/PIC32CZ4010CA80144.atdf
        <register name="FFLR" offset="0x28" rw="RW" size="4" access-size="4" caption="ETM FIFO Full Level Register">
        </register>
        <register name="CNTRLDVR1" offset="0x140" rw="RW" size="4" access-size="4" caption="ETM Free-running Counter Reload Value">
        </register>
        <register name="SYNCFR" offset="0x1E0" rw="R" size="4" access-size="4" initval="0x00000400" caption="ETM Synchronization Frequency Register">
        </register>
        <register name="IDR" offset="0x1E4" rw="R" size="4" access-size="4" initval="0x4114F250" caption="ETM ID Register">
        </register>
        <register name="CCER" offset="0x1E8" rw="R" size="4" access-size="4" initval="0x18541800" caption="ETM Configuration Code Extension Register">
        </register>
        <register name="TESSEICR" offset="0x1F0" rw="RW" size="4" access-size="4" caption="ETM TraceEnable Start/Stop EmbeddedICE Control Register">
        </register>
        <register name="TSEVT" offset="0x1F8" rw="RW" size="4" access-size="4" caption="ETM TimeStamp Event Register">
        </register>
        <register name="TRACEIDR" offset="0x200" rw="RW" size="4" access-size="4" initval="0x00000000" caption="ETM CoreSight Trace ID Register">
        </register>
        <register name="IDR2" offset="0x208" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM ID Register 2">
        </register>
        <register name="PDSR" offset="0x314" rw="R" size="4" access-size="4" initval="0x00000001" caption="ETM Device Power-Down Status Register">
        </register>
        <register name="ITMISCIN" offset="0xEE0" rw="R" size="4" access-size="4" caption="ETM Integration Test Miscellaneous Inputs">
        </register>
        <register name="ITTRIGOUT" offset="0xEE8" rw="W" size="4" access-size="4" caption="ETM Integration Test Trigger Out">
        </register>
        <register name="ITATBCTR2" offset="0xEF0" rw="R" size="4" access-size="4" caption="ETM Integration Test ATB Control 2">
        </register>
        <register name="ITATBCTR0" offset="0xEF8" rw="W" size="4" access-size="4" caption="ETM Integration Test ATB Control 0">
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" initval="0x00000000" caption="ETM Integration Mode Control Register">
          <bitfield name="INTEGRATION" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="ETM Claim Tag Set Register">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="ETM Claim Tag Clear Register">
        </register>
        <register name="LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="ETM Lock Access Register">
        </register>
        <register name="LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="ETM Lock Status Register">
          <bitfield name="Present" caption="" mask="0x1"/>
          <bitfield name="Access" caption="" mask="0x2"/>
          <bitfield name="ByteAcc" caption="" mask="0x4"/>
        </register>
        <register name="AUTHSTATUS" offset="0xFB8" rw="R" size="4" access-size="4" caption="ETM Authentication Status Register">
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" initval="0x00000013" caption="ETM CoreSight Device Type Register">
        </register>
        <register name="PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" initval="0x00000004" caption="ETM Peripheral Identification Register #4">
        </register>
        <register name="PIDR5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM Peripheral Identification Register #5">
        </register>
        <register name="PIDR6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM Peripheral Identification Register #6">
        </register>
        <register name="PIDR7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM Peripheral Identification Register #7">
        </register>
        <register name="PIDR0" offset="0xFE0" rw="R" size="4" access-size="4" initval="0x00000025" caption="ETM Peripheral Identification Register #0">
        </register>
        <register name="PIDR1" offset="0xFE4" rw="R" size="4" access-size="4" initval="0x000000B9" caption="ETM Peripheral Identification Register #1">
        </register>
        <register name="PIDR2" offset="0xFE8" rw="R" size="4" access-size="4" initval="0x0000000B" caption="ETM Peripheral Identification Register #2">
        </register>
        <register name="PIDR3" offset="0xFEC" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM Peripheral Identification Register #3">
        </register>
        <register name="CIDR0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="ETM Component  Identification Register #0">
        </register>
        <register name="CIDR1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x00000090" caption="ETM Component  Identification Register #1">
        </register>
        <register name="CIDR2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="ETM Component  Identification Register #2">
        </register>
        <register name="CIDR3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="ETM Component  Identification Register #3">
        </register>
      </register-group>
    </module>
    <module name="EVSYS" id="03601" name2="ptg_evsys_u2504_v2" version="2b0" caption="Event System Interface">
      <register-group name="CHANNEL" size="0x8">
        <register name="CHANNEL" offset="0x0" rw="RW" size="4" initval="0x00008000" caption="Channel n Control">
          <bitfield name="EVGEN" caption="Event Generator Selection" mask="0xFF"/>
          <bitfield name="PATH" caption="Path Selection" mask="0x300" values="EVSYS_CHANNEL__PATH"/>
          <bitfield name="EDGSEL" caption="Edge Detection Selection" mask="0xC00" values="EVSYS_CHANNEL__EDGSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in standby" mask="0x4000"/>
          <bitfield name="ONDEMAND" caption="Generic Clock On Demand" mask="0x8000"/>
        </register>
        <register name="CHINTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:CHINTENCLR" initval="0x00" caption="Channel n Interrupt Enable Clear">
          <bitfield name="OVR" caption="Channel Overrun Interrupt Disable" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected Interrupt Disable" mask="0x2"/>
        </register>
        <register name="CHINTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:CHINTENSET" initval="0x00" caption="Channel n Interrupt Enable Set">
          <bitfield name="OVR" caption="Channel Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected Interrupt Enable" mask="0x2"/>
        </register>
        <register name="CHINTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:CHINTFLAG" initval="0x00" caption="Channel n Interrupt Flag Status and Clear">
          <bitfield name="OVR" caption="Channel Overrun" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected" mask="0x2"/>
        </register>
        <register name="CHSTATUS" offset="0x7" rw="R" size="1" initval="0x01" caption="Channel n Status">
          <bitfield name="RDYUSR" caption="Ready User" mask="0x1"/>
          <bitfield name="BUSYCH" caption="Busy Channel" mask="0x2"/>
        </register>
      </register-group>
